Luca code/app/controllers/doses_controller.rb

  def create
    @dose = Dose.new(dose_params)
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose.cocktail = @cocktail

    if @dose.save
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "cocktail_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "It a fresh an chill cocktail"], ["cocktail_id", 2], ["ingredient_id", 4], ["created_at", "2018-02-19 07:50:12.185060"], ["updated_at", "2018-02-19 07:50:12.185060"]]