app/controllers/cocktails_controller.rb

  def index
    @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"

  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mojito"], ["created_at", "2018-02-19 10:12:29.100715"], ["updated_at", "2018-02-19 10:12:29.100715"]]

  def set_cocktail
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]